function Location() {
	this.items	= {
	'0':{1:'奥迪',22:'天津市',44:'上海市',66:'重庆市',108:'河北省',406:'山西省',622:'内蒙古',804:'辽宁省',945:'吉林省',1036:'黑龙江省',1226:'江苏省',1371:'浙江省',1500:'安徽省',1679:'福建省',1812:'江西省',1992:'山东省',2197:'河南省',2456:'湖北省',2613:'湖南省',2822:'广东省',3015:'广西',3201:'海南省',3235:'四川省',3561:'贵州省',3728:'云南省',3983:'西藏',4136:'陕西省',4334:'甘肃省',4499:'青海省',4588:'宁夏',4624:'新疆',4802:'香港',4822:'澳门',4825:'台湾省'},
	'0,1':{2:'A1',6:'A3',18:'A4'},
	'0,1,2':{3:'1.4 TFSI 7档双离合 Urban款',4:'1.4 TFSI 7档双离合 Ego款',5:'1.4 TFSI 7档双离合 Ego plus款'},
	'0,1,6':{7:'Sportback 1.4T 自动 舒适型',8:'Sportback 1.4T 自动 豪华型',9:'Sportback 1.8T 自动 豪华型',10:'Sportback 1.8T 自动 尊贵型',11:'Sportback 1.4T 自动 技术型',12:'Sportback 1.4T 舒适型',13:'Sportback 1.4T 豪华型',14:'Sportback 首发限量版舒适型',15:'Sportback 首发限量版豪华型',16:'Sportback 1.8T 豪华型',17:'Sportback 1.8T 尊贵型'},
	'0,1,18':{19:'3.0 quattro敞蓬',20:'1.8T'},
	
	
	
	'0,22':{23:'天津市'},
	'0,22,23':{24:'和平区',25:'河东区',26:'河西区',27:'南开区',28:'河北区',29:'红桥区',30:'塘沽区',31:'汉沽区',32:'大港区',33:'东丽区',34:'西青区',35:'津南区',36:'北辰区',37:'武清区',38:'宝坻区',39:'蓟县',40:'宁河县',41:'芦台镇',42:'静海县',43:'静海镇'},
	'0,108':{109:'石家庄市',145:'张家口市',176:'承德市',196:'秦皇岛市',208:'唐山市',229:'廊坊市',246:'保定市',290:'衡水市',310:'沧州市',337:'邢台市',372:'邯郸市'},
	'0,108,109':{110:'长安区',111:'桥东区',112:'桥西区',113:'新华区',114:'裕华区',115:'井陉矿区',116:'辛集市',117:'藁城市',118:'晋州市',119:'新乐市',120:'鹿泉市',121:'井陉县',122:'微水镇',123:'正定县',124:'正定镇',125:'栾城县',126:'栾城镇',127:'行唐县',128:'龙州镇',129:'灵寿县',130:'灵寿镇',131:'高邑县',132:'高邑镇',133:'深泽县',134:'深泽镇',135:'赞皇县',136:'赞皇镇',137:'无极县',138:'无极镇',139:'平山县',140:'平山镇',141:'元氏县',142:'槐阳镇',143:'赵县',144:'赵州镇'},
	'0,108,145':{146:'桥西区',147:'桥东区',148:'宣化区',149:'下花园区',150:'宣化县',151:'张家口市宣化区',152:'张北县',153:'张北镇',154:'康保县',155:'康保镇',156:'沽源县',157:'平定堡镇',158:'尚义县',159:'南壕堑镇',160:'蔚县',161:'蔚州镇',162:'阳原县',163:'西城镇',164:'怀安县',165:'柴沟堡镇',166:'万全县',167:'孔家庄镇',168:'怀来县',169:'沙城镇',170:'涿鹿县',171:'涿鹿镇',172:'赤城县',173:'赤城镇',174:'崇礼县',175:'西湾子镇'},
	'0,108,176':{177:'双桥区',178:'双滦区',179:'鹰手营子矿区',180:'承德县',181:'下板城镇',182:'兴隆县',183:'兴隆镇',184:'平泉县',185:'平泉镇',186:'滦平县',187:'滦平镇',188:'隆化县',189:'隆化镇',190:'丰宁满族自治县',191:'大阁镇',192:'宽城满族自治县',193:'宽城镇',194:'围场满族蒙古族自治县',195:'围场镇'},
	'0,108,196':{197:'海港区',198:'山海关区',199:'北戴河区',200:'昌黎县',201:'昌黎镇',202:'抚宁县',203:'抚宁镇',204:'卢龙县',205:'卢龙镇',206:'青龙满族自治县',207:'青龙镇'},
	'0,108,208':{209:'路北区',210:'路南区',211:'古冶区',212:'开平区',213:'丰润区',214:'丰南区',215:'遵化市',216:'迁安市',217:'滦县',218:'滦州镇',219:'滦南县',220:'倴城镇',221:'乐亭县',222:'乐亭镇',223:'迁西县',224:'兴城镇',225:'玉田县',226:'玉田镇',227:'唐海县',228:'唐海镇'},
	'0,108,229':{230:'安次区',231:'广阳区',232:'霸州市',233:'三河市',234:'固安县',235:'固安镇',236:'永清县',237:'永清镇',238:'香河县',239:'淑阳镇',240:'大城县',241:'平舒镇',242:'文安县',243:'文安镇',244:'大厂回族自治县',245:'大厂镇'},
	'0,108,246':{247:'新市区',248:'北市区',249:'南市区',250:'定州市',251:'涿州市',252:'安国市',253:'高碑店市',254:'满城县',255:'满城镇',256:'清苑县',257:'清苑镇',258:'易县',259:'易州镇',260:'徐水县',261:'安肃镇',262:'涞源县',263:'涞源镇',264:'定兴县',265:'定兴镇',266:'顺平县',267:'蒲阳镇',268:'唐县',269:'仁厚镇',270:'望都县',271:'望都镇',272:'涞水县',273:'涞水镇',274:'高阳县',275:'高阳镇',276:'安新县',277:'安新镇',278:'雄县',279:'雄州镇',280:'容城县',281:'容城镇',282:'曲阳县',283:'恒州镇',284:'阜平县',285:'阜平镇',286:'博野县',287:'博陵镇',288:'蠡县',289:'蠡吾镇'},
	
	};
}

Location.prototype.find	= function(id) {
	if(typeof(this.items[id]) == "undefined")
		return false;
	return this.items[id];
}

Location.prototype.fillOption	= function(el_id , loc_id , selected_id) {
	var el	= $('#'+el_id); 
	var json	= this.find(loc_id); 
	if (json) {
		var index	= 1;
		var selected_index	= 0;
		$.each(json , function(k , v) {
			var option	= '<option value="'+k+'">'+v+'</option>';
			el.append(option);
			
			if (k == selected_id) {
				selected_index	= index;
			}
			
			index++;
		})
		//el.attr('selectedIndex' , selected_index); 
	}
	el.select2("val", "");
}

